testCases/01_body_immersion/I_addModel_RepeatSamePosition/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "monkey_mod" );
// bodyNames ( "impeller_mod" );

interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     1;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain -1;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default


outputSetup
{
    basic false;
    iB  false;
    DEM false;
    addModel false;
    parallelDEM false;
}

monkey_mod
{
    staticBody;

    rho         rho [1 -3 0 0 0 0 0] 1;
    material particle;
    
    bodyGeom nonConvex;

    updateTorque false;
    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers 2;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }

}

DEM
{
    // LcCoeff 4.0;
    // LcCoeff 0.55;
    // rotationModel chen2012;
	// rotationModel mindlin1953
    materials
    {
        particle
        {
            Y       1;
            nu      0;
            mu      0;
            adhN    0;
            eps     1;
        }

        wall
        {
            Y       1;
            nu      0;
            mu      0;
            adhN    0;
            eps     1;
        }
    }

    collisionPatches
    {

    }
}

// ************************************************************************* //
